---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Revision
source: html/51167cf5-cfe3-32e6-87d6-2618e587fdce.htm
---
# Revision Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.